ansi-escapes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-12 Sat 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ansi escape sequences</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">ansi escape sequences</h1>
<p>
this page is mostly borrowed from <a href="https://githhub.com/dylanaraps">dylanaraps</a>' <a href="https://github.com/dylanaraps/pure-sh-bible">pure-sh-bible</a>.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. text colors</a></li>
<li><a href="#org0000001">2. text formatting</a></li>
<li><a href="#org0000002">3. cursor movement</a></li>
<li><a href="#org0000003">4. erasing text</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> text colors</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sequence</th>
<th scope="col" class="org-left">what it does</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>\033[38;5;&lt;NUM&gt;m</code></td>
<td class="org-left">set text foreground color. (256color)</td>
<td class="org-left"><code>0-255</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[48;5;&lt;NUM&gt;m</code></td>
<td class="org-left">set text background color. (256color)</td>
<td class="org-left"><code>0-255</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[38;2;&lt;R&gt;;&lt;G&gt;;&lt;B&gt;m</code></td>
<td class="org-left">set text foreground color. (truecolor)</td>
<td class="org-left"><code>red</code>, <code>green</code>, <code>blue</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[48;2;&lt;R&gt;;&lt;G&gt;;&lt;B&gt;m</code></td>
<td class="org-left">set text background color. (truecolor)</td>
<td class="org-left"><code>red</code>, <code>green</code>, <code>blue</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> text formatting</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sequence</th>
<th scope="col" class="org-left">what it does</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>\033[m</code></td>
<td class="org-left">reset text formatting and colors.</td>
</tr>

<tr>
<td class="org-left"><code>\033[1m</code></td>
<td class="org-left">bold text.</td>
</tr>

<tr>
<td class="org-left"><code>\033[2m</code></td>
<td class="org-left">faint text.</td>
</tr>

<tr>
<td class="org-left"><code>\033[3m</code></td>
<td class="org-left">italic text.</td>
</tr>

<tr>
<td class="org-left"><code>\033[4m</code></td>
<td class="org-left">underline text.</td>
</tr>

<tr>
<td class="org-left"><code>\033[5m</code></td>
<td class="org-left">slow blink.</td>
</tr>

<tr>
<td class="org-left"><code>\033[7m</code></td>
<td class="org-left">swap foreground and background colors.</td>
</tr>

<tr>
<td class="org-left"><code>\033[8m</code></td>
<td class="org-left">hidden text.</td>
</tr>

<tr>
<td class="org-left"><code>\033[9m</code></td>
<td class="org-left">strike-through text.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">3.</span> cursor movement</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sequence</th>
<th scope="col" class="org-left">what it does</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>\033[&lt;LINE&gt;;&lt;COLUMN&gt;H</code></td>
<td class="org-left">move cursor to absolute position.</td>
<td class="org-left"><code>line</code>, <code>column</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[H</code></td>
<td class="org-left">move cursor to home position (<code>0,0</code>).</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>\033[&lt;NUM&gt;A</code></td>
<td class="org-left">move cursor up NUM lines.</td>
<td class="org-left"><code>num</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[&lt;NUM&gt;B</code></td>
<td class="org-left">move cursor down NUM lines.</td>
<td class="org-left"><code>num</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[&lt;NUM&gt;C</code></td>
<td class="org-left">move cursor right NUM columns.</td>
<td class="org-left"><code>num</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[&lt;NUM&gt;D</code></td>
<td class="org-left">move cursor left NUM columns.</td>
<td class="org-left"><code>num</code></td>
</tr>

<tr>
<td class="org-left"><code>\033[s</code></td>
<td class="org-left">save cursor position.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>\033[u</code></td>
<td class="org-left">restore cursor position.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>\033[?25l</code></td>
<td class="org-left">hide cursor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>\033[?25h</code></td>
<td class="org-left">show cursor</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">4.</span> erasing text</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sequence</th>
<th scope="col" class="org-left">what it does</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>\033[K</code></td>
<td class="org-left">erase from cursor position to end of line.</td>
</tr>

<tr>
<td class="org-left"><code>\033[1K</code></td>
<td class="org-left">erase from cursor position to start of line.</td>
</tr>

<tr>
<td class="org-left"><code>\033[2K</code></td>
<td class="org-left">erase the entire current line.</td>
</tr>

<tr>
<td class="org-left"><code>\033[J</code></td>
<td class="org-left">erase from the current line to the bottom of the screen.</td>
</tr>

<tr>
<td class="org-left"><code>\033[1J</code></td>
<td class="org-left">erase from the current line to the top of the screen.</td>
</tr>

<tr>
<td class="org-left"><code>\033[2J</code></td>
<td class="org-left">clear the screen.</td>
</tr>

<tr>
<td class="org-left"><code>\033[2J\033[H</code></td>
<td class="org-left">clear the screen and move cursor to <code>0,0</code>.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
